not_enough_places = ("[ERROR] Не достаточно мест в группах для записи новых пользователей.\n"
                     "Вы можете либо изменить максимальное кол-во студентов группы на вкладке 'Продукты'.\n"
                     "Либо добавить новые группы на странице 'Учебные группы'.")

incorrect_product_creation = ("[ERROR] Прежде чем добавлять пользователя в продукт вам нужно создать группу которая "
                              "будет принадлежать этому курсу!!\n"
                              "Шаги выполнения:\n"
                              "1) Создать курс\n"
                              "2) Создать группу\n"
                              "3) Добавить пользователя к продукту")
not_enough_people = ("Не достаточно людей для наполнения группы хотя бы до минимального кол-ва студентов.\n"
                     "Рекомендуется поставить минимальное кол-во участников группы=0")
